{
  "greenhouse-7572572": {
    "job_id": "greenhouse-7572572",
    "company": "Airbnb",
    "title": "Software Engineer, Listings",
    "location": "United States",
    "posted_at": "2026-02-17T16:25:33-05:00",
    "apply_url": "https://careers.airbnb.com/positions/7572572?gh_jid=7572572",
    "description": "&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-family: helvetica, arial, sans-serif; font-size: 12pt;&quot;&gt;Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;The Community You Will Join:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Listings Platform team is responsible for building the Listing data plane and control plane, maintaining and evolving the core data models and storage infrastructure for all our product verticals, and core merchandising features. Our vision is to enable hosts of all scales to merchandise their space &amp;amp; make hospitality easy by providing Hosts with tools to intuitively manage any kind of space, and building the platform that quickly serves the data to various merchandising surfaces. The team is focused on building robust, modular and flexible systems that allow efficient development and fast rollout of product features. The team is a broad scope with direct impacts to Airbnb’s highest priorities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Difference You Will Make:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a highly skilled and motivated engineer who is passionate about making a difference through their work. The Listings Platform team is working towards modularizing our systems to support fast product iteration. As a key contributor, you will have the unique opportunity to be involved in some of the most impactful projects in the company. Being in the core of the stack, you will have the opportunities to be exposed to and utilize a wide range of technologies.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A Typical Day:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work cross-functionally with product, design, and other engineering counterparts to execute on product and business strategy to build novel products and features&lt;/li&gt;\n&lt;li&gt;Work with senior engineers technical leaders in the team to deliver system improvements that would enable fast product feature deliveries.&lt;/li&gt;\n&lt;li&gt;Create paved paths and best practices within the listings space.&lt;/li&gt;\n&lt;li&gt;Build efficient and backend solutions that are reliable, performant and scalable.&lt;/li&gt;\n&lt;li&gt;Collaborate with team members and cross functional partners to define product definitions and roadmaps&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Expertise:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;2+ years of experience in software engineering.&lt;/li&gt;\n&lt;li&gt;Proficiency in one or more JVM based languages (Java, Kotlin, Scala, etc.) are preferred&lt;/li&gt;\n&lt;li&gt;Experience with architectural patterns of large, high-scale data applications is a plus.&lt;/li&gt;\n&lt;li&gt;Experiences of distributed systems, data stores, data modeling, indexing and associated trade-offs is a plus.&lt;/li&gt;\n&lt;li&gt;Passion for learning. Our team touches the whole backend stack of Airbnb and collaborates extensively with other teams, quick learning and strong communication skills is a must.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This position is US - Remote Eligible. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager. While the position is Remote Eligible, you must live in a state where Airbnb, Inc. has a registered entity.&lt;a href=&quot;https://careers.airbnb.com/&quot;&gt; Click here&lt;/a&gt; for the up-to-date list of excluded states. This list is continuously evolving, so please check back with us if the state you live in is on the exclusion list. If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Commitment To Inclusion &amp;amp; Belonging:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Airbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.&lt;/p&gt;\n&lt;p&gt;We strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: &lt;a href=&quot;mailto:reasonableaccommodations@airbnb.com&quot;&gt;reasonableaccommodations@airbnb.com&lt;/a&gt;. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application.&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-pay-transparency&quot;&gt;&lt;div class=&quot;pay-input&quot;&gt;&lt;div class=&quot;description&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 16px;&quot;&gt;&lt;strong&gt;&lt;span style=&quot;font-family: arial, helvetica, sans-serif; color: rgb(0, 0, 0);&quot;&gt;How We&#39;ll Take Care of You:&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p class=&quot;p1&quot;&gt;&lt;span style=&quot;font-size: 16px;&quot;&gt;Our job titles may span more than one career level. The actual base pay is dependent upon many factors, such as: training, transferable skills, work experience, business needs and market demands. The base pay range is subject to change and may be modified in the future. This role may also be eligible for bonus, equity, benefits, and Employee Travel Credits. &amp;nbsp;&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;&lt;div class=&quot;title&quot;&gt;Pay Range&lt;/div&gt;&lt;div class=&quot;pay-range&quot;&gt;&lt;span&gt;$157,000&lt;/span&gt;&lt;span class=&quot;divider&quot;&gt;&amp;mdash;&lt;/span&gt;&lt;span&gt;$180,600 USD&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;",
    "provider": "greenhouse"
  },
  "greenhouse-7591861": {
    "job_id": "greenhouse-7591861",
    "company": "Coinbase",
    "title": "Software Engineer, Backend (Consumer - Advanced Trading)",
    "location": "US - Remote Zone 1 (Job Requisitions Only)",
    "posted_at": "2026-02-19T17:07:53-05:00",
    "apply_url": "https://www.coinbase.com/careers/positions/7591861?gh_jid=7591861",
    "description": "&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Ready to be pushed beyond what you think you’re capable of?&lt;/p&gt;\n&lt;p&gt;At Coinbase, our mission is to increase economic freedom in the world. It’s a massive, ambitious opportunity that demands the best of us, every day, as we build the emerging onchain platform — and with it, the future global financial system.&lt;/p&gt;\n&lt;p&gt;To achieve our mission, we’re seeking a very specific candidate. We want someone who is passionate about our mission and who believes in the power of crypto and blockchain technology to update the financial system. We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up. We want someone who will run towards, not away from, solving the company’s hardest problems.&lt;/p&gt;\n&lt;p&gt;Our &lt;a href=&quot;https://www.coinbase.com/mission&quot;&gt;work culture&lt;/a&gt; is intense and isn’t for everyone. But if you want to build the future alongside others who excel in their disciplines and expect the same from you, there’s no better place to be.&lt;/p&gt;\n&lt;p&gt;While many roles at Coinbase are remote-first, we are not remote-only. In-person participation is required throughout the year. Team and company-wide offsites are held multiple times annually to foster collaboration, connection, and alignment. Attendance is expected and fully supported.&lt;/p&gt;&lt;/div&gt;&lt;p&gt;Coinbase is seeking experienced backend engineers to join our Advanced Trading team to build and scale the core systems that power crypto trading at Coinbase. The &lt;a href=&quot;https://help.coinbase.com/en/coinbase/trading-and-funding/advanced-trade/what-is-advanced-trade&quot;&gt;Advanced Trade&lt;/a&gt; team is building a seamless and secure trading platform for experienced traders. This is a rare opportunity to work at the intersection of crypto, trading infrastructure, and consumer product — tackling exciting engineering challenges while contributing directly to Coinbase’s core business.&lt;br&gt;&lt;br&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you&#39;ll be doing:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Power highly performant, highly available systems for traders worldwide&lt;/li&gt;\n&lt;li&gt;Architect robust systems that are easy to build on top of supporting many instrument types (Spot, Futures, Perpetual Futures, and more)&lt;/li&gt;\n&lt;li&gt;Work in tight collaboration with product and design to articulate a best-in-class product experience&lt;/li&gt;\n&lt;li&gt;Translate your best ideas into tangible, high value features our customers love&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we look for in you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You have at least 2+ years of experience in software engineering, especially with web-scale traffic&lt;/li&gt;\n&lt;li&gt;You’ve designed, built, scaled, and maintained production services as they evolve over time&lt;/li&gt;\n&lt;li&gt;You have a high bar for product excellence, pairing customer obsession with comprehensive observability&lt;/li&gt;\n&lt;li&gt;You empower and cultivate your teammates. Iron sharpens iron&lt;/li&gt;\n&lt;li&gt;You take pride in being up-to-date with the latest industry standards and best practices&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to haves:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You’ve worked on active trading systems or other similar high availability financial systems&lt;/li&gt;\n&lt;li&gt;You actively trade crypto or other financial instruments&lt;/li&gt;\n&lt;li&gt;You have gone through a rapid growth in your company (from startup to mid-size).&lt;/li&gt;\n&lt;li&gt;You have experience upgrading significant parts of legacy systems, or re-architecting next-generation versions of existing systems&lt;/li&gt;\n&lt;li&gt;You’ve worked with Golang, MongoDB, Redis, Snowflake before&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Job #: P75753&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Pay Transparency Notice:&amp;nbsp; Depending on your work location, the target annual salary for this position can range from $[Zone 3 Pay] to $[Zone 1 Pay] + target bonus + target equity + benefits (including medical, dental, vision and 401(k)).&lt;/span&gt;&lt;/p&gt;\n&lt;div id=&quot;fortidlp-input-element-parent&quot;&gt;&lt;/div&gt;&lt;div class=&quot;content-pay-transparency&quot;&gt;&lt;div class=&quot;pay-input&quot;&gt;&lt;div class=&quot;description&quot;&gt;&lt;p&gt;&lt;strong&gt;Pay Transparency Notice&lt;/strong&gt;:&lt;em&gt; &lt;/em&gt;Depending on your work location, the target annual &lt;strong&gt;base &lt;/strong&gt;salary for this position can range as detailed below. Full time offers from Coinbase also include bonus eligibility + equity eligibility + benefits (including medical, dental, vision and 401(k)).&lt;/p&gt;\n&lt;div id=&quot;fortidlp-input-element-parent&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;div class=&quot;title&quot;&gt;Base salary range shown. Total compensation also includes equity and bonus eligibility and benefits:&lt;/div&gt;&lt;div class=&quot;pay-range&quot;&gt;&lt;span&gt;$152,405&lt;/span&gt;&lt;span class=&quot;divider&quot;&gt;&amp;mdash;&lt;/span&gt;&lt;span&gt;$179,300 USD&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Please be advised that each candidate may submit a maximum of four applications within any 30-day period. We encourage you to carefully evaluate how your skills and interests align with Coinbase&#39;s roles before applying.&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Commitment to Equal Opportunity&lt;/h3&gt;\n&lt;p&gt;Coinbase is proud to be an Equal Opportunity Employer.&amp;nbsp; All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law.&amp;nbsp; For US applicants, you may view the &lt;a href=&quot;https://www.dol.gov/sites/dolgov/files/WHD/legacy/files/eppac.pdf&quot;&gt;Employee Rights&lt;/a&gt; and the &lt;a href=&quot;https://www.eeoc.gov/sites/default/files/2023-06/22-088_EEOC_KnowYourRights6.12.pdf&quot;&gt;Know Your Rights notices&lt;/a&gt; by clicking on their corresponding links. Additionally, Coinbase participates in the &lt;a href=&quot;https://static-assets.coinbase.com/e-verify.pdf&quot;&gt;E-Verify program&lt;/a&gt; in certain locations, as required by law.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Coinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please contact us at accommodations[at]coinbase.com to let us know the nature of your request and your contact information. &amp;nbsp; For quick access to screen reading technology compatible with this site&lt;a href=&quot;https://chrome.google.com/webstore/detail/chromevox/kgejglhpjiefppelpmljglcjbhoiplfn&quot;&gt; click here to download&lt;/a&gt; a free compatible screen reader&lt;a href=&quot;http://www.chromevox.com/tutorial/&quot;&gt; (free step by step tutorial can be found here)&lt;/a&gt;.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Global Data Privacy Notice for Job Candidates and Applicants&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Depending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available &lt;a href=&quot;https://www.coinbase.com/legal/applicant_privacy_notice&quot;&gt;here&lt;/a&gt;. By submitting your application, you are agreeing to our use and processing of your data as required. For US applicants only, by submitting your application you are agreeing to arbitration of disputes as outlined &lt;a href=&quot;https://www.coinbase.com/legal/application-arbitration-agreement&quot;&gt;here.&lt;/a&gt; &amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;AI Disclosure&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;&lt;em&gt;For select roles, Coinbase is piloting an AI tool based on machine learning technologies to conduct initial screening interviews to qualified applicants. The tool simulates realistic interview scenarios and engages in dynamic conversation. A human recruiter will review your interview responses, provided in the form of a voice recording and/or transcript, to assess them against the qualifications and characteristics outlined in the job description.&amp;nbsp;&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;For select roles, Coinbase is also piloting an AI interview intelligence platform to transcribe and summarize interview notes, allowing our interviewers to fully focus on you as the candidate.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The above pilots are for testing purposes and Coinbase will not use AI to make decisions impacting employment&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;. To request a reasonable accommodation due to disability, please contact accommodations[at]coinbase.com&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;div id=&quot;fortidlp-input-element-parent&quot;&gt;&lt;/div&gt;&lt;/div&gt;",
    "provider": "greenhouse"
  },
  "greenhouse-7595352": {
    "job_id": "greenhouse-7595352",
    "company": "Coinbase",
    "title": "Software Engineer, DevSec",
    "location": "Remote - USA",
    "posted_at": "2026-02-19T13:43:01-05:00",
    "apply_url": "https://www.coinbase.com/careers/positions/7595352?gh_jid=7595352",
    "description": "&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Ready to be pushed beyond what you think you’re capable of?&lt;/p&gt;\n&lt;p&gt;At Coinbase, our mission is to increase economic freedom in the world. It’s a massive, ambitious opportunity that demands the best of us, every day, as we build the emerging onchain platform — and with it, the future global financial system.&lt;/p&gt;\n&lt;p&gt;To achieve our mission, we’re seeking a very specific candidate. We want someone who is passionate about our mission and who believes in the power of crypto and blockchain technology to update the financial system. We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up. We want someone who will run towards, not away from, solving the company’s hardest problems.&lt;/p&gt;\n&lt;p&gt;Our &lt;a href=&quot;https://www.coinbase.com/mission&quot;&gt;work culture&lt;/a&gt; is intense and isn’t for everyone. But if you want to build the future alongside others who excel in their disciplines and expect the same from you, there’s no better place to be.&lt;/p&gt;\n&lt;p&gt;While many roles at Coinbase are remote-first, we are not remote-only. In-person participation is required throughout the year. Team and company-wide offsites are held multiple times annually to foster collaboration, connection, and alignment. Attendance is expected and fully supported.&lt;/p&gt;&lt;/div&gt;&lt;p&gt;The Developer Security team secures Coinbase&#39;s software supply chain and builds automation to find and fix vulnerabilities at scale. We own artifact scanning, dependency analysis, vulnerability management, and security agents that automate remediation across the company. As a Software Engineer on this team, you will build and ship features across these systems. You will work with engineers across Coinbase to make security a natural part of how they build software.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you’ll be doing (ie. job duties):&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Build and maintain services to meet critical product and business needs using Golang.&lt;/li&gt;\n&lt;li&gt;Deliver features and small-to-medium projects end-to-end: design, implementation, deployment, and monitoring.&lt;/li&gt;\n&lt;li&gt;Author technical design documents and break down complex features into individual tasks.&lt;/li&gt;\n&lt;li&gt;Write high quality, well tested code to meet the needs of your customers.&lt;/li&gt;\n&lt;li&gt;Improve code quality and address technical debt within your ownership area.&lt;/li&gt;\n&lt;li&gt;Participate in on-call rotations, code reviews, and incident response.&lt;/li&gt;\n&lt;li&gt;Work with engineers, product managers, and security partners to deliver on the team&#39;s roadmap.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we look for in you (ie. job requirements):&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least 2 years of experience in software engineering.&lt;/li&gt;\n&lt;li&gt;You have built, deployed, and maintained production services and understand service-oriented architecture.&lt;/li&gt;\n&lt;li&gt;You write high quality, well tested code.&lt;/li&gt;\n&lt;li&gt;You can author technical design documents and break down features into discrete tasks.&lt;/li&gt;\n&lt;li&gt;You actively use modern tooling (including AI-assisted development) to ship faster and learn new domains quickly.&lt;/li&gt;\n&lt;li&gt;You are passionate about building an open financial system that brings the world together.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to haves:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with security tooling or security-adjacent engineering (e.g., SLSA, Sigstore, artifact scanning, SBOM).&lt;/li&gt;\n&lt;li&gt;Familiarity with Artifactory, Xray, or similar supply chain security platforms.&lt;/li&gt;\n&lt;li&gt;Experience with Golang, Docker, Kubernetes, Postgres, MongoDB, gRPC.&lt;/li&gt;\n&lt;li&gt;Experience with cloud infrastructure (AWS or GCP).&lt;/li&gt;\n&lt;li&gt;You have worked at a company during a period of rapid growth.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Job #: 75879&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Pay Transparency Notice:&amp;nbsp; Depending on your work location, the target annual salary for this position can range from $&lt;span style=&quot;font-weight: 400;&quot;&gt;152,405&lt;/span&gt;&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; to $179,300&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;+ target bonus + target equity + benefits (including medical, dental, vision and 401(k)). &lt;/span&gt;&lt;/p&gt;\n&lt;div id=&quot;fortidlp-input-element-parent&quot;&gt;&lt;/div&gt;&lt;div class=&quot;content-pay-transparency&quot;&gt;&lt;div class=&quot;pay-input&quot;&gt;&lt;div class=&quot;description&quot;&gt;&lt;p&gt;&lt;strong&gt;Pay Transparency Notice&lt;/strong&gt;:&lt;em&gt; &lt;/em&gt;Depending on your work location, the target annual &lt;strong&gt;base &lt;/strong&gt;salary for this position can range as detailed below. Full time offers from Coinbase also include bonus eligibility + equity eligibility + benefits (including medical, dental, vision and 401(k)).&lt;/p&gt;\n&lt;div id=&quot;fortidlp-input-element-parent&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;div class=&quot;title&quot;&gt;Base salary range shown. Total compensation also includes equity and bonus eligibility and benefits:&lt;/div&gt;&lt;div class=&quot;pay-range&quot;&gt;&lt;span&gt;$152,405&lt;/span&gt;&lt;span class=&quot;divider&quot;&gt;&amp;mdash;&lt;/span&gt;&lt;span&gt;$179,300 USD&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Please be advised that each candidate may submit a maximum of four applications within any 30-day period. We encourage you to carefully evaluate how your skills and interests align with Coinbase&#39;s roles before applying.&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Commitment to Equal Opportunity&lt;/h3&gt;\n&lt;p&gt;Coinbase is proud to be an Equal Opportunity Employer.&amp;nbsp; All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law.&amp;nbsp; For US applicants, you may view the &lt;a href=&quot;https://www.dol.gov/sites/dolgov/files/WHD/legacy/files/eppac.pdf&quot;&gt;Employee Rights&lt;/a&gt; and the &lt;a href=&quot;https://www.eeoc.gov/sites/default/files/2023-06/22-088_EEOC_KnowYourRights6.12.pdf&quot;&gt;Know Your Rights notices&lt;/a&gt; by clicking on their corresponding links. Additionally, Coinbase participates in the &lt;a href=&quot;https://static-assets.coinbase.com/e-verify.pdf&quot;&gt;E-Verify program&lt;/a&gt; in certain locations, as required by law.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Coinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please contact us at accommodations[at]coinbase.com to let us know the nature of your request and your contact information. &amp;nbsp; For quick access to screen reading technology compatible with this site&lt;a href=&quot;https://chrome.google.com/webstore/detail/chromevox/kgejglhpjiefppelpmljglcjbhoiplfn&quot;&gt; click here to download&lt;/a&gt; a free compatible screen reader&lt;a href=&quot;http://www.chromevox.com/tutorial/&quot;&gt; (free step by step tutorial can be found here)&lt;/a&gt;.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Global Data Privacy Notice for Job Candidates and Applicants&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Depending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available &lt;a href=&quot;https://www.coinbase.com/legal/applicant_privacy_notice&quot;&gt;here&lt;/a&gt;. By submitting your application, you are agreeing to our use and processing of your data as required. For US applicants only, by submitting your application you are agreeing to arbitration of disputes as outlined &lt;a href=&quot;https://www.coinbase.com/legal/application-arbitration-agreement&quot;&gt;here.&lt;/a&gt; &amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;AI Disclosure&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;&lt;em&gt;For select roles, Coinbase is piloting an AI tool based on machine learning technologies to conduct initial screening interviews to qualified applicants. The tool simulates realistic interview scenarios and engages in dynamic conversation. A human recruiter will review your interview responses, provided in the form of a voice recording and/or transcript, to assess them against the qualifications and characteristics outlined in the job description.&amp;nbsp;&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;For select roles, Coinbase is also piloting an AI interview intelligence platform to transcribe and summarize interview notes, allowing our interviewers to fully focus on you as the candidate.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The above pilots are for testing purposes and Coinbase will not use AI to make decisions impacting employment&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;. To request a reasonable accommodation due to disability, please contact accommodations[at]coinbase.com&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;div id=&quot;fortidlp-input-element-parent&quot;&gt;&lt;/div&gt;&lt;/div&gt;",
    "provider": "greenhouse"
  },
  "greenhouse-7610995": {
    "job_id": "greenhouse-7610995",
    "company": "Dropbox",
    "title": "Software Engineer (T)",
    "location": "United States",
    "posted_at": "2026-02-18T15:17:14-05:00",
    "apply_url": "https://jobs.dropbox.com/listing/7610995?gh_jid=7610995",
    "description": "&lt;p&gt;&lt;strong&gt;Job Title:&lt;/strong&gt; &amp;nbsp; Software Engineer (T)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Duties&lt;/strong&gt;: Research, design, build, and test the next generation of Dropbox&#39;s engineering technologies. Build software to handle metadata for hundreds of billions of files, hundreds of petabytes of user data, and millions of concurrent connections. Analyze software requirements to deliver a feasible design within time and cost constraints. Write modular, secure, and well-tested code to ensure the integrity of our technologies. Collaborate with crossfunctional teams to develop highly scalable performant solutions. Ensure that our development environment is best in class by delivering improvements to internal tooling and direct partnership with our product platform teams.&lt;/p&gt;\n&lt;p&gt;*Telecommuting permitted 100% of the time from anywhere in the US&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specials Skills&lt;/strong&gt;: Must possess expertise/knowledge sufficient to adequately perform the duties of the job being offered. Expertise/knowledge may be gained through employment experience or education. Such expertise/knowledge cannot be “quantified” by “time.” Required expertise/knowledge includes:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;C, C++, C#, or Java;&lt;/li&gt;\n&lt;li&gt;Python, React, Go, or JavaScript;&lt;/li&gt;\n&lt;li&gt;Git, Phabricator, Jira or equivalent version control and task management tools;&lt;/li&gt;\n&lt;li&gt;Unit and integration testing, or debugging;&lt;/li&gt;\n&lt;li&gt;Software Development Life Cycle;&lt;/li&gt;\n&lt;li&gt;Data processing, programming languages , networking, operating systems, computer graphics, or human-computer interaction;&lt;/li&gt;\n&lt;li&gt;Algorithms or databases; and&lt;/li&gt;\n&lt;li&gt;Application Development.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;*Employer will accept any suitable combination of education, training, or experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Education/Experience&lt;/strong&gt;: Bachelor’s degree (or foreign equivalent) in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field (or foreign equivalent) plus 8 years in job offered or closely related occupation OR Master’s degree in Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics, Physics, or related field (or foreign equivalent) plus 5 years in job offered or closely related occupation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other&lt;/strong&gt;:&amp;nbsp; Job Site: Dropbox, Inc. 1800 Owens Street, San Francisco, CA 94158.&lt;/p&gt;\n&lt;p&gt;*Telecommuting permitted 100% of the time from anywhere in the US&lt;/p&gt;\n&lt;p&gt;In San Francisco, CA metro, the expected salary range for the role is $100,000 - $150,000. Several factors are considered to determine starting pay: job/level, location/metropolitan area, skillset, peer compensation.&lt;/p&gt;\n&lt;p&gt;40 hours/week. If offered employment, must have legal right to work in U.S. EOE.&lt;/p&gt;",
    "provider": "greenhouse"
  },
  "greenhouse-7602727": {
    "job_id": "greenhouse-7602727",
    "company": "Twilio",
    "title": "Software Engineer",
    "location": "Remote - US",
    "posted_at": "2026-02-19T10:12:52-05:00",
    "apply_url": "https://job-boards.greenhouse.io/twilio/jobs/7602727",
    "description": "&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;strong&gt;Who we are&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Twilio, we’re shaping the future of communications, all from the comfort of our homes. We deliver innovative solutions to&lt;a class=&quot;c-link&quot; href=&quot;https://customers.twilio.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://customers.twilio.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;&amp;nbsp;hundreds of thousands of businesses&amp;nbsp;&lt;/a&gt;and empower millions of developers worldwide to craft personalized customer experiences.&lt;/p&gt;\n&lt;p&gt;Our dedication to &lt;a class=&quot;c-link&quot; href=&quot;https://www.twilio.com/en-us/blog/open-work&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.twilio.com/en-us/blog/open-work&quot; data-sk=&quot;tooltip_parent&quot;&gt;remote-first work&lt;/a&gt;, and strong culture of connection and global inclusion means that no matter your location, you’re part of a vibrant team with diverse experiences making a global impact each day. As we continue to revolutionize how the world interacts, we’re acquiring new skills and experiences that make work feel truly rewarding. Your career at Twilio is in your hands.&lt;br&gt;&lt;br&gt;We use Artificial Intelligence (AI) to help make our hiring process efficient, fair, and transparent, but automation never makes the final call. Every hiring decision is made by real Twilions, ensuring a human touch at every step.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;color: rgb(255, 255, 255);&quot;&gt;.&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;strong&gt;See yourself at Twilio&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;Join the team as our next Software Engineer - Audiences &amp;amp; Journeys&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;About the job&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;Segment is a best-in-class&lt;a href=&quot;https://segment.com/resources/cdp/&quot; target=&quot;_blank&quot;&gt; customer data platform (CDP)&lt;/a&gt; designed with engineers, marketers, and product managers in mind. We’re excited to work at the cutting edge of data and artificial intelligence, such as with our&lt;a href=&quot;https://segment.com/blog/ai-assisted-magical-mappings/&quot; target=&quot;_blank&quot;&gt; AI-Assisted Suggest Mappings product&lt;/a&gt;. And, we move &lt;em&gt;a lot&lt;/em&gt; of data -&lt;a href=&quot;https://segment.com/purpose-built-customer-data-platform/#:~:text=12%20trillion%20API%20calls/year&quot; target=&quot;_blank&quot;&gt; over &lt;em&gt;12 trillion&lt;/em&gt; API calls a year&lt;/a&gt;.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;This position is needed to build and scale APIs to enable Twilio developers to unlock best-in-class personalized customer experiences through the Twilio &lt;a href=&quot;https://segment.com/product/twilio-engage/audiences/&quot; target=&quot;_blank&quot;&gt;Audiences&lt;/a&gt; &amp;amp; &lt;a href=&quot;https://www.twilio.com/en-us/press/releases/twilio-segment-unveils-journeys-the-first-customer-journey-builder-for-the-new-digital-era&quot; target=&quot;_blank&quot;&gt;Journeys&lt;/a&gt; products. As a Software Engineer on the team, you will collaborate closely with product management, architecture, and other engineering teams to design APIs, identify performance bottlenecks, and data models, and drive system-level improvements that enhance both developer velocity and customer experience. You’ll be expected to evaluate and communicate trade-offs between feature velocity, system stability, and technical debt, and help drive architectural decisions that ensure long-term sustainability and performance.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;We iterate quickly on these products and features and learn new things daily — all while writing quality code using the latest AI tools. We work closely with product and design and solve some of the toughest engineering problems to unlock new possibilities for our customers. If you get excited by building products with high customer impact — this is the place for you.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;In this role, you’ll:&lt;/div&gt;\n&lt;ul&gt;\n&lt;li&gt;Design and build robust, scalable backend systems and APIs that power audience &amp;amp; journey creation, segmentation, and activation across Segment’s data platform.&lt;/li&gt;\n&lt;li&gt;Collaborate cross-functionally with design, product, and other engineers to define solutions that balance usability, performance, and long-term architecture.&lt;/li&gt;\n&lt;li&gt;Communicate technical decisions clearly - articulating trade-offs, customer impact, and team alignment.&lt;/li&gt;\n&lt;li&gt;Mentor junior engineers and contribute to a culture of technical excellence and continuous learning.&lt;/li&gt;\n&lt;li&gt;Troubleshoot and improve system reliability, debugging issues and refining operational tooling and processes.&lt;/li&gt;\n&lt;li&gt;Participate in an on-call rotation for our managed services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;Qualifications&amp;nbsp;&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;Not all applicants will have skills that match a job description exactly. Twilio values diverse experiences in other industries, and we encourage everyone who meets the required qualifications to apply. While having “desired” qualifications make for a strong candidate, we encourage applicants with alternative experiences to also apply. If your career is just starting or hasn&#39;t followed a traditional path, don&#39;t let that stop you from considering Twilio. We are always looking for people who will bring something new to the table!&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;Required:&lt;/strong&gt;&lt;/div&gt;\n&lt;ul&gt;\n&lt;li&gt;2 years experience writing production-grade code in a modern programming language&lt;/li&gt;\n&lt;li&gt;Experience programming in one or more of the following: Go, Java, Python, or similar languages&lt;/li&gt;\n&lt;li&gt;Experience operating large-scale, distributed systems on top of cloud infrastructure such as Amazon Web Services (AWS)&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Have hands-on experience with container orchestration frameworks (e.g. Kubernetes, EKS, ECS)&lt;/li&gt;\n&lt;li&gt;Have experience with large scale async processing systems&lt;/li&gt;\n&lt;li&gt;Experience shipping services (products) following CI/CD development paradigm.&lt;/li&gt;\n&lt;li&gt;Good grasp of software engineering and how to build a system in scalable and extensive manner;&lt;/li&gt;\n&lt;li&gt;Excellent written and verbal technical communication skills to convey complex technical concepts effectively.&lt;/li&gt;\n&lt;li&gt;Comfortable asking questions and taking initiative to solve problems where it is often necessary to “&lt;a href=&quot;https://www.twilio.com/en-us/company/values&quot; target=&quot;_blank&quot;&gt;draw the owl&lt;/a&gt;”&lt;/li&gt;\n&lt;li&gt;Leverage best-in-class development productivity practices including AI tooling&lt;/li&gt;\n&lt;/ul&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;Location:&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;This role will be remote,&lt;em&gt; &lt;/em&gt;but is not eligible to be hired in CA, CT, NJ, NY, PA, WA.&lt;/strong&gt;&lt;/div&gt;\n&lt;ul&gt;\n&lt;li&gt;No mandatory travel is anticipated.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;Compensation:&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&lt;em&gt;*Please note this role is open to candidates outside of California, Colorado, Hawaii, Illinois, Maryland, Massachusetts, Minnesota, New Jersey, New York, Vermont, Washington D.C., and Washington State. The information below is provided for candidates hired in those locations only.&lt;/em&gt;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;The estimated pay ranges for this role are as follows:&lt;/div&gt;\n&lt;ul&gt;\n&lt;li&gt;Based in Colorado, Hawaii, Illinois, Maryland, Massachusetts, Minnesota, Vermont or Washington D.C.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;$116,960.00 to $146,200.00.&lt;/li&gt;\n&lt;li&gt;Based in New York, New Jersey, Washington State, or California (outside of the San Francisco Bay a&lt;/li&gt;\n&lt;li&gt;rea): $123,760.00 to $154,700.00).&lt;/li&gt;\n&lt;li&gt;Based in the San Francisco Bay area, California: $137,520.00 to $171,900.00).&lt;/li&gt;\n&lt;li&gt;This role may be eligible to participate in Twilio’s equity plan and corporate bonus plan. All roles are generally eligible for the following benefits: health care insurance, 401(k) retirement account, paid sick time, paid personal time off, paid parental leave.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;div&gt;The successful candidate’s starting salary will be determined based on permissible, non-discriminatory factors such as skills, experience, and geographic location.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;There are many benefits to working at Twilio, including, in addition to competitive pay, things like generous time-off, ample parental and wellness leave, healthcare, a retirement savings program, and much more. Offerings vary by location.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;Applications for this role are intended to be accepted until 2/23/2026, but may change based on business needs.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;strong&gt;Twilio thinks big. Do you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We like to solve problems, take initiative, pitch in when needed, and are always up for trying new things. That&#39;s why we seek out colleagues who embody our values — something we call &lt;a href=&quot;https://www.twilio.com/company/values&quot;&gt;Twilio Magic&lt;/a&gt;. Additionally, we empower employees to build &lt;a href=&quot;https://twilio.org/support-and-resources/impact-fund&quot;&gt;positive change in their communities&lt;/a&gt; by supporting their volunteering and donation efforts.&lt;/p&gt;\n&lt;p&gt;So, if you&#39;re ready to unleash your full potential, do your best work, and be the best version of yourself, apply now! If this role isn&#39;t what you&#39;re looking for, &lt;a href=&quot;https://www.twilio.com/company/jobs#open-positions&quot;&gt;please consider other open positions.&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Twilio is proud to be an equal opportunity employer.&lt;/strong&gt; We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Qualified applicants with arrest or conviction records will be considered for employment in accordance with the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Additionally, Twilio participates in the E-Verify program in certain locations, as required by law.&lt;/p&gt;&lt;/div&gt;",
    "provider": "greenhouse"
  },
  "ashby-d4dcd344-40cf-44d6-a7dd-172118eb0842": {
    "job_id": "ashby-d4dcd344-40cf-44d6-a7dd-172118eb0842",
    "company": "OpenAI",
    "title": "Software Engineer, Observability",
    "location": "San Francisco",
    "posted_at": "2026-02-19T20:41:43.290+00:00",
    "apply_url": "https://jobs.ashbyhq.com/openai/d4dcd344-40cf-44d6-a7dd-172118eb0842",
    "description": "<p style=\"min-height:1.5em\">Join the engineering teams that bring OpenAI’s ideas safely to the world!!</p><p style=\"min-height:1.5em\">The Applied Engineering team works across research, engineering, product, and design to bring OpenAI’s technology to consumers and businesses. We seek to learn from deployment and distribute the benefits of AI, while ensuring that this powerful tool is used responsibly and safely. Safety is more important to us than unfettered growth.</p><p style=\"min-height:1.5em\"><strong>About the Role</strong></p><p style=\"min-height:1.5em\">We’re building the observability product for OpenAI—from scalable infrastructure to a rich, AI-powered UI. Our systems ingest over petabytes of logs and billions of time series metrics across our fleet. We're now layering intelligence on top—think agents that summarize SEVs, auto-generate dashboards, or help engineers debug through notebook-like UIs.</p><p style=\"min-height:1.5em\">We’re hiring software engineers across the stack—infra, backend, and product. You’ll join a small, gritty team building both foundational infra and novel internal tools to make OpenAI's production systems reliable, performant, and observable.</p><p style=\"min-height:1.5em\"><strong>What You’ll Do</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own core observability infrastructure, including distributed logging, time series, and trace storage</p></li><li><p style=\"min-height:1.5em\">Build AI-native tools that help engineers detect, understand, and resolve issues autonomously.</p></li><li><p style=\"min-height:1.5em\">Contribute to UI experiences like dashboards, notebooking, or interactive debugging</p></li><li><p style=\"min-height:1.5em\">Collaborate closely with engineers, researchers, user ops, and other teams across the company to build the next generation observability product</p></li></ul><p style=\"min-height:1.5em\"><strong>You Might Be a Fit If You:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Have operated large-scale distributed systems in production. ( especially logging systems or some other time series databases)</p></li><li><p style=\"min-height:1.5em\">Thrive in ambiguous environments and roll up your sleeves to solve unscoped problems.</p></li><li><p style=\"min-height:1.5em\">Have full-stack chops or product sensibilities—you're excited to build real tools people use.</p></li><li><p style=\"min-height:1.5em\">Have strong fundamentals in systems, networking, and cloud infra (Kubernetes, AWS, etc).</p></li><li><p style=\"min-height:1.5em\"><u>Bonus</u>: built or contributed to observability systems (e.g. Prometheus, OpenTelemetry, etc).</p></li></ul><p style=\"min-height:1.5em\"><strong>Why This Team</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We’re both an infra and product team—building a real AI application for internal use.</p></li><li><p style=\"min-height:1.5em\">Your work will directly power the reliability of GPT-based products at massive scale.</p></li><li><p style=\"min-height:1.5em\">You'll help define what \"AI-powered observability\" looks like at one of the world’s most advanced AI labs.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About OpenAI</strong></p><p style=\"min-height:1.5em\">OpenAI is an AI research and deployment company dedicated to ensuring that general-purpose artificial intelligence benefits all of humanity. We push the boundaries of the capabilities of AI systems and seek to safely deploy them to the world through our products. AI is an extremely powerful tool that must be created with safety and human needs at its core, and to achieve our mission, we must encompass and value the many different perspectives, voices, and experiences that form the full spectrum of humanity. </p><p style=\"min-height:1.5em\">We are an equal opportunity employer, and we do not discriminate on the basis of race, religion, color, national origin, sex, sexual orientation, age, veteran status, disability, genetic information, or other applicable legally protected characteristic. </p><p style=\"min-height:1.5em\">For additional information, please see <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"c-link c-link--underline\" href=\"https://cdn.openai.com/policies/eeo-policy-statement.pdf\"><u>OpenAI’s Affirmative Action and Equal Employment Opportunity Policy Statement</u></a>.</p><p style=\"min-height:1.5em\">Background checks for applicants will be administered in accordance with applicable law, and qualified applicants with arrest or conviction records will be considered for employment consistent with those laws, including the San Francisco Fair Chance Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, for US-based candidates. For unincorporated Los Angeles County workers: we reasonably believe that criminal history may have a direct, adverse and negative relationship with the following job duties, potentially resulting in the withdrawal of a conditional offer of employment: protect computer hardware entrusted to you from theft, loss or damage; return all computer hardware in your possession (including the data contained therein) upon termination of employment or end of assignment; and maintain the confidentiality of proprietary, confidential, and non-public information. In addition, job duties require access to secure and protected information technology systems and related data security obligations.</p><p style=\"min-height:1.5em\">To notify OpenAI that you believe this job posting is non-compliant, please submit a report through <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://form.asana.com/?d=57018692298241&amp;k=5MqR40fZd7jlxVUh5J-UeA\">this form</a>. No response will be provided to inquiries unrelated to job posting compliance.</p><p style=\"min-height:1.5em\">We are committed to providing reasonable accommodations to applicants with disabilities, and requests can be made via this <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"c-link c-link--underline\" href=\"https://form.asana.com/?k=bQ7w9h3iexRlicUdWRiwvg&amp;d=57018692298241\"><u>link</u></a>.</p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"c-link\" href=\"https://cdn.openai.com/policies/global-employee-and-contractor-privacy-policy.pdf\">OpenAI Global Applicant Privacy Policy</a></p><p style=\"min-height:1.5em\">At OpenAI, we believe artificial intelligence has the potential to help people solve immense global challenges, and we want the upside of AI to be widely shared. Join us in shaping the future of technology.</p>",
    "provider": "ashby"
  },
  "ashby-60e52bb7-3418-447c-8767-a6bb8e7dedd8": {
    "job_id": "ashby-60e52bb7-3418-447c-8767-a6bb8e7dedd8",
    "company": "OpenAI",
    "title": "Software Engineer, Codex App",
    "location": "San Francisco",
    "posted_at": "2026-02-18T19:26:08.306+00:00",
    "apply_url": "https://jobs.ashbyhq.com/openai/60e52bb7-3418-447c-8767-a6bb8e7dedd8",
    "description": "<h2><strong>About the Team</strong></h2><p style=\"min-height:1.5em\">The Codex App team owns the desktop application and IDE extension that bring Codex into developers’ daily workflows. We build product experiences end-to-end, and we care equally about usability, performance, and reliability.</p><p style=\"min-height:1.5em\">Our stack is centered on a TypeScript/Node/Electron application that interfaces with external systems including the Codex CLI and app server (Rust). Building great features here often means designing clean boundaries between UI, local services, and native processes — and making the whole system observable and resilient.</p><p style=\"min-height:1.5em\"></p><h2><strong>About the Role</strong></h2><p style=\"min-height:1.5em\">We’re hiring a Full Stack Software Engineer to build and evolve the systems that power the Codex desktop app and IDE extension. “Full stack” here means owning flows from UI → Node/TypeScript backend layers → IPC/process orchestration → integration with Rust services.</p><p style=\"min-height:1.5em\">This is a product-minded role. You’ll help define workflows, pick the right abstractions, and ship features that feel fast and dependable in real developer environments.</p><p style=\"min-height:1.5em\"></p><h2><strong>What You’ll Do</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build end-to-end features across the Electron app (UI + Node/TypeScript backend layers).</p></li><li><p style=\"min-height:1.5em\">Design robust integrations with the Codex CLI and app server (Rust), including process lifecycle, streaming output, and error handling.</p></li><li><p style=\"min-height:1.5em\">Own IPC architecture and patterns (renderer/main boundaries, message schemas, backpressure, safety, debugging).</p></li><li><p style=\"min-height:1.5em\">Build systems for orchestration: long-running tasks, incremental progress updates, cancellation, retries, and state synchronization.</p></li><li><p style=\"min-height:1.5em\">Improve reliability, observability, and performance (logging/tracing/metrics, profiling, crash/debug tooling).</p></li><li><p style=\"min-height:1.5em\">Partner with design and product to turn ambiguous needs into crisp, shippable workflows.<br /></p></li></ul><h2><strong>You Might Thrive Here If You</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Have strong TypeScript/Node fundamentals and enjoy owning product features end-to-end.</p></li><li><p style=\"min-height:1.5em\">Have experience with Electron or desktop app architecture (renderer/main separation, performance pitfalls, packaging/release concerns).</p></li><li><p style=\"min-height:1.5em\">Are comfortable integrating with native processes/services (e.g., Rust) and designing clean, testable boundaries.</p></li><li><p style=\"min-height:1.5em\">Know (or are excited to learn) IPC patterns and distributed-systems-like thinking applied locally: message ordering, buffering, backpressure, retries, idempotency.</p></li><li><p style=\"min-height:1.5em\">Bring strong product judgment and enjoy iterating based on real usage and feedback.</p></li><li><p style=\"min-height:1.5em\">Have experience with developer tools, CLIs, or IDE integrations (nice-to-have).</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About OpenAI</strong></p><p style=\"min-height:1.5em\">OpenAI is an AI research and deployment company dedicated to ensuring that general-purpose artificial intelligence benefits all of humanity. We push the boundaries of the capabilities of AI systems and seek to safely deploy them to the world through our products. AI is an extremely powerful tool that must be created with safety and human needs at its core, and to achieve our mission, we must encompass and value the many different perspectives, voices, and experiences that form the full spectrum of humanity. </p><p style=\"min-height:1.5em\">We are an equal opportunity employer, and we do not discriminate on the basis of race, religion, color, national origin, sex, sexual orientation, age, veteran status, disability, genetic information, or other applicable legally protected characteristic. </p><p style=\"min-height:1.5em\">For additional information, please see <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"c-link c-link--underline\" href=\"https://cdn.openai.com/policies/eeo-policy-statement.pdf\"><u>OpenAI’s Affirmative Action and Equal Employment Opportunity Policy Statement</u></a>.</p><p style=\"min-height:1.5em\">Background checks for applicants will be administered in accordance with applicable law, and qualified applicants with arrest or conviction records will be considered for employment consistent with those laws, including the San Francisco Fair Chance Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, for US-based candidates. For unincorporated Los Angeles County workers: we reasonably believe that criminal history may have a direct, adverse and negative relationship with the following job duties, potentially resulting in the withdrawal of a conditional offer of employment: protect computer hardware entrusted to you from theft, loss or damage; return all computer hardware in your possession (including the data contained therein) upon termination of employment or end of assignment; and maintain the confidentiality of proprietary, confidential, and non-public information. In addition, job duties require access to secure and protected information technology systems and related data security obligations.</p><p style=\"min-height:1.5em\">To notify OpenAI that you believe this job posting is non-compliant, please submit a report through <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://form.asana.com/?d=57018692298241&amp;k=5MqR40fZd7jlxVUh5J-UeA\">this form</a>. No response will be provided to inquiries unrelated to job posting compliance.</p><p style=\"min-height:1.5em\">We are committed to providing reasonable accommodations to applicants with disabilities, and requests can be made via this <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"c-link c-link--underline\" href=\"https://form.asana.com/?k=bQ7w9h3iexRlicUdWRiwvg&amp;d=57018692298241\"><u>link</u></a>.</p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"c-link\" href=\"https://cdn.openai.com/policies/global-employee-and-contractor-privacy-policy.pdf\">OpenAI Global Applicant Privacy Policy</a></p><p style=\"min-height:1.5em\">At OpenAI, we believe artificial intelligence has the potential to help people solve immense global challenges, and we want the upside of AI to be widely shared. Join us in shaping the future of technology.</p>",
    "provider": "ashby"
  },
  "ashby-5f6685ad-2fba-4e60-8982-fa142b33e194": {
    "job_id": "ashby-5f6685ad-2fba-4e60-8982-fa142b33e194",
    "company": "OpenAI",
    "title": "Frontend Software Engineer, Codex App",
    "location": "San Francisco",
    "posted_at": "2026-02-18T19:26:22.362+00:00",
    "apply_url": "https://jobs.ashbyhq.com/openai/5f6685ad-2fba-4e60-8982-fa142b33e194",
    "description": "<h2><strong>About the Team</strong></h2><p style=\"min-height:1.5em\">The Codex App team builds and maintains the Codex desktop app and IDE extension — the primary ways developers interact with Codex. Our goal is to make AI feel like a real software engineering teammate inside real workflows: editing code, running tasks, reviewing changes, and coordinating long-running work.</p><p style=\"min-height:1.5em\">We sit at the intersection of research, product, and design. We ship quickly, learn from real usage, and continuously refine both the experience and the harness that connects users to the model.</p><p style=\"min-height:1.5em\"></p><h2><strong>About the Role</strong></h2><p style=\"min-height:1.5em\">We’re hiring a Frontend Software Engineer to build a top-tier desktop experience and push forward the interface for working with agents. This is a craft-heavy role: you’ll partner closely with design to prototype, iterate, and polish new interaction models — then turn them into reliable, high-performance product.</p><p style=\"min-height:1.5em\">You’ll help define what great looks like for “human ↔ agent” collaboration: what belongs in the UI, how state is represented, how progress and uncertainty are communicated, and how users stay oriented across long-running and multi-step work.</p><p style=\"min-height:1.5em\"></p><h2><strong>What You’ll Do</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build and ship polished, high-performance UI across the Codex desktop app and IDE extension.</p></li><li><p style=\"min-height:1.5em\">Partner tightly with design to turn prototypes into production-quality experiences (layout, motion, typography, interaction details).</p></li><li><p style=\"min-height:1.5em\">Iterate on future interfaces for interacting with agents: delegation, task timelines, status/progress, handoffs, review, and control surfaces.</p></li><li><p style=\"min-height:1.5em\">Own frontend architecture decisions (component systems, state management, navigation, rendering performance).</p></li><li><p style=\"min-height:1.5em\">Improve quality and reliability through testing, instrumentation, and thoughtful UX for failure modes.</p></li><li><p style=\"min-height:1.5em\">Collaborate with platform/model/backend partners to integrate new capabilities into cohesive product flows.<br /></p></li></ul><h2><strong>You Might Thrive Here If You</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Have strong experience with modern frontend stacks (React, TypeScript) and a high bar for UI craft.</p></li><li><p style=\"min-height:1.5em\">Love design engineering: sweating the details while keeping velocity.</p></li><li><p style=\"min-height:1.5em\">Have built desktop-caliber product experiences (Electron or similar), and care about performance, responsiveness, and “it just feels right.”</p></li><li><p style=\"min-height:1.5em\">Enjoy exploring ambiguous problems and iterating rapidly with design and product.</p></li><li><p style=\"min-height:1.5em\">Think in end-to-end workflows, not isolated screens.</p></li><li><p style=\"min-height:1.5em\">Have experience with developer tools or IDE extensions (nice-to-have).</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About OpenAI</strong></p><p style=\"min-height:1.5em\">OpenAI is an AI research and deployment company dedicated to ensuring that general-purpose artificial intelligence benefits all of humanity. We push the boundaries of the capabilities of AI systems and seek to safely deploy them to the world through our products. AI is an extremely powerful tool that must be created with safety and human needs at its core, and to achieve our mission, we must encompass and value the many different perspectives, voices, and experiences that form the full spectrum of humanity. </p><p style=\"min-height:1.5em\">We are an equal opportunity employer, and we do not discriminate on the basis of race, religion, color, national origin, sex, sexual orientation, age, veteran status, disability, genetic information, or other applicable legally protected characteristic. </p><p style=\"min-height:1.5em\">For additional information, please see <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"c-link c-link--underline\" href=\"https://cdn.openai.com/policies/eeo-policy-statement.pdf\"><u>OpenAI’s Affirmative Action and Equal Employment Opportunity Policy Statement</u></a>.</p><p style=\"min-height:1.5em\">Background checks for applicants will be administered in accordance with applicable law, and qualified applicants with arrest or conviction records will be considered for employment consistent with those laws, including the San Francisco Fair Chance Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, for US-based candidates. For unincorporated Los Angeles County workers: we reasonably believe that criminal history may have a direct, adverse and negative relationship with the following job duties, potentially resulting in the withdrawal of a conditional offer of employment: protect computer hardware entrusted to you from theft, loss or damage; return all computer hardware in your possession (including the data contained therein) upon termination of employment or end of assignment; and maintain the confidentiality of proprietary, confidential, and non-public information. In addition, job duties require access to secure and protected information technology systems and related data security obligations.</p><p style=\"min-height:1.5em\">To notify OpenAI that you believe this job posting is non-compliant, please submit a report through <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://form.asana.com/?d=57018692298241&amp;k=5MqR40fZd7jlxVUh5J-UeA\">this form</a>. No response will be provided to inquiries unrelated to job posting compliance.</p><p style=\"min-height:1.5em\">We are committed to providing reasonable accommodations to applicants with disabilities, and requests can be made via this <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"c-link c-link--underline\" href=\"https://form.asana.com/?k=bQ7w9h3iexRlicUdWRiwvg&amp;d=57018692298241\"><u>link</u></a>.</p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"c-link\" href=\"https://cdn.openai.com/policies/global-employee-and-contractor-privacy-policy.pdf\">OpenAI Global Applicant Privacy Policy</a></p><p style=\"min-height:1.5em\">At OpenAI, we believe artificial intelligence has the potential to help people solve immense global challenges, and we want the upside of AI to be widely shared. Join us in shaping the future of technology.</p>",
    "provider": "ashby"
  },
  "workday-nvidia-System-Software-Engineer---GPU_JR2013295": {
    "job_id": "workday-nvidia-System-Software-Engineer---GPU_JR2013295",
    "company": "Nvidia",
    "title": "System Software Engineer - GPU",
    "location": "United States, CA, Santa Clara",
    "posted_at": "2026-02-20",
    "apply_url": "https://nvidia.wd5.myworkdayjobs.com/job/US-CA-Santa-Clara/System-Software-Engineer---GPU_JR2013295",
    "provider": "workday"
  }
}